#pragma once

#include <QColor>
#include <vector>

inline std::vector<QColor> chartColors() {
  return {
    QColor("#1f77b4"), // 1  синий
    QColor("#ff7f0e"), // 2  оранжевый
    QColor("#2ca02c"), // 3  зелёный
    QColor("#d62728"), // 4  красный
    QColor("#9467bd"), // 5  фиолетовый
    QColor("#8c564b"), // 6  коричневый
    QColor("#e377c2"), // 7  розовый
    QColor("#7f7f7f"), // 8  серый
    QColor("#bcbd22"), // 9  оливковый
    QColor("#17becf"), // 10 бирюзовый

    QColor("#aec7e8"), // 11 светло-синий
    QColor("#ffbb78"), // 12 светло-оранжевый
    QColor("#98df8a"), // 13 светло-зелёный
    QColor("#ff9896"), // 14 светло-красный
    QColor("#c5b0d5"), // 15 светло-фиолетовый
    QColor("#c49c94"), // 16 светло-коричневый
    QColor("#f7b6d2"), // 17 светло-розовый
    QColor("#c7c7c7"), // 18 светло-серый
    QColor("#dbdb8d"), // 19 светло-оливковый
    QColor("#9edae5"), // 20 светло-бирюзовый

    QColor("#393b79"), // 21 тёмно-синий
    QColor("#637939"), // 22 тёмно-оливковый
    QColor("#8c6d31"), // 23 тёмно-золотой
    QColor("#843c39"), // 24 тёмно-красный
    QColor("#7b4173"), // 25 тёмно-фиолетовый
    QColor("#3182bd"), // 26 средне-синий
    QColor("#31a354"), // 27 средне-зелёный
    QColor("#756bb1"), // 28 средне-фиолетовый
    QColor("#636363"), // 29 тёмно-серый
    QColor("#e6550d"), // 30 тёмно-оранжевый
  };
}
